<p style="font-size:30px; text-align:center; line-height:120%">
<br>
COMS W 4111-02 Fall 2020<br>
Introduction to Databases<br>
Homework 1c: Programming Track<br>

</p>

# Overview and Instructions

In this part of homework 1c, you will have to:
- Clean up data from the Lahman baseball database
- Write a sql query to get the career stats of a given player. 

__Assignment Due Date: Sunday, October 11, 11:59pm__

<hr style="height:2px">

## Part 0: Import Data + Database Connection

### Load the data:
- Download the .dump file provided in the assignment on courseworks
- Open workbench, click 'Data Import/Restore' under Management
- Select 'Import from Self-Contained File' and either provide the path in the text box to the .dump file or click on the three dots to the right to find the file
- Under "Defult Target Schema to Load into" click new and name the schema ```lahman2019```
- Click 'Start Import' on the bottom right to begin

### Connect to the schema you just created:

In [1]:
%load_ext sql
%sql mysql+pymysql://jhatkins:Models=fairytales7@localhost/lahman2019

<hr style="height:2px">

## Part 1: Data Cleanup
Data cleanup: For each table we want you to clean, we have provided a list of changes you have to make. You should make these changes through sql workbench's table editor and using sql queries. In this part you will clean two tables: People and Batting. 


### You must have: 
- A brief explanation of why we asked you to make each change
- What change you made to the table
- Any queries you used to make the changes, either the ones you wrote or the Alter statements provided by SQL workbench's table editor. 
- Executed the test statements we provided
- The cleaned table's new create statement (after you finish all the changes) 

### Overview of Changes:

People Table 

   0. Primary Key (Explanation is given, but you still must add the key to your table yourself)
   1. Empty strings to NULLs
   2. Column typing
   3. isDead column
   4. deathDate and birthDate column

Batting Table

   1. Empty strings to NULLs
   2. Column typing
   3. Primary Key
   4. Foreign Key
   
### How to make the changes: 

__Using the Table Editor:__

When you hit apply, a popup will open displaying the ALTER statments sql generates. Copy the sql provided first and paste it into this notebook. Then you can apply the changes. This means that you are NOT executing the ALTER statements through your notebook. 


<img src="workbench_table_editor.png">

<img src="workbench_apply_changes.png">


__Using sql queries:__

Copy paste any queries that you write manually into the notebook as well!


<hr style="height:2px">

## People Table

### 0) Add a Primary Key (Solutions are given but make sure you still do this step in workbench!!)

#### Explanation

We want to add a Primary Key because we want to be able to uniquely identify rows within our data. A primary key is also an index, which allows us to locate data faster.

#### Change

I added a Primary Key on the playerID column and made the datatype VARCHAR(15)

#### SQL

~~~~sql
ALTER TABLE `lahman2017`.`fielding`
CHANGE COLUMN `playerID` `playerID` VARCHAR(15) NOT NULL ,
ADD PRIMARY KEY (`playerID`);
~~~~

#### Tests

In [2]:
%sql SHOW KEYS FROM people WHERE Key_name = 'PRIMARY'

 * mysql+pymysql://jhatkins:***@localhost/lahman2019
1 rows affected.

[('people', 0, 'PRIMARY', 1, 'playerID', 'A', 19398, None, None, '', 'BTREE', '', '', 'YES', None)]

### 1) Convert all empty strings to NULL

#### Explanation

Nan values will lead to errors when functions are applied to the columns so we need to convert them to null so sql knows how to deal with the empty values.

#### Change

I Updated each column to remove the nan values and replace them with null.

#### SQL

~~~~sql
UPDATE people
SET birthState=null
WHERE birthState='nan';

UPDATE people
SET birthYear=null
WHERE birthYear='nan';

UPDATE people
SET birthDay=null
WHERE birthDay='nan';

UPDATE people
SET birthCountry=null
WHERE birthCountry='nan';

UPDATE people
SET birthCity=null
WHERE birthCity='nan';

UPDATE people
SET deathYear=null
WHERE deathYear='nan';

UPDATE people
SET deathMonth=null
WHERE deathMonth='nan';

UPDATE people
SET deathDay=null
WHERE deathDay='nan';

UPDATE people
SET deathCountry=null
WHERE deathCountry='nan';

UPDATE people
SET deathState=null
WHERE deathState='nan';

UPDATE people
SET deathCity=null
WHERE deathCity='nan';

UPDATE people
SET nameFirst=null
WHERE nameFirst='nan';

UPDATE people
SET nameLast=null
WHERE nameLast='nan';

UPDATE people
SET nameGiven=null
WHERE nameGiven='nan';

UPDATE people
SET weight=null
WHERE weight='nan';

UPDATE people
SET height=null
WHERE height='nan';

UPDATE people
SET bats=null
WHERE bats='nan';

UPDATE people
SET throws=null
WHERE throws='nan';

UPDATE people
SET debut=null
WHERE debut='nan';

UPDATE people
SET finalGame=null
WHERE finalGame='nan';

UPDATE people
SET retroID=null
WHERE retroID='nan';

UPDATE people
SET bbrefID=null
WHERE bbrefID='nan';


~~~~

#### Tests

In [13]:
%sql SELECT * FROM people WHERE birthState='nan' or birthState=''

 * mysql+pymysql://jhatkins:***@localhost/lahman2019
0 rows affected.

[]

### 2) Change column datatypes to appropriate values (ENUM, INT, VARCHAR, DATETIME, ETC)

#### Explanation

The datatypes of the table need to be changed from text to their true types. This will ensure that we can immediately error check by making sure the input and each value of the column is the correct type or null.

#### Change

month, day, year columns are changed to INT, along with weight and height. Columns with dates such as debut and final game are changed to date. ENUM is used for columns with a few set choices such as bats and throws. The rest of the columns are text and changed to VARCHAR(40) or VARCHAR(12) depending on length.

#### SQL

~~~~sql
ALTER TABLE people
MODIFY COLUMN birthYear INT;

ALTER TABLE people
MODIFY COLUMN birthMonth INT;

ALTER TABLE people
MODIFY COLUMN birthDay INT;

ALTER TABLE people
MODIFY COLUMN deathYear INT;

ALTER TABLE people
MODIFY COLUMN deathMonth INT;

ALTER TABLE people
MODIFY COLUMN deathDay INT;

ALTER TABLE people
MODIFY COLUMN birthDay INT;

ALTER TABLE people
MODIFY COLUMN weight INT;

ALTER TABLE people
MODIFY COLUMN height INT;

ALTER TABLE people
MODIFY COLUMN debut DATE;

ALTER TABLE people
MODIFY COLUMN finalGame DATE;

ALTER TABLE `lahman2019`.`people` 
CHANGE COLUMN `birthCountry` `birthCountry` VARCHAR(40) NULL DEFAULT NULL ,
CHANGE COLUMN `birthState` `birthState` VARCHAR(40) NULL DEFAULT NULL ,
CHANGE COLUMN `birthCity` `birthCity` VARCHAR(40) NULL DEFAULT NULL ,
CHANGE COLUMN `deathCountry` `deathCountry` VARCHAR(40) NULL DEFAULT NULL ,
CHANGE COLUMN `deathState` `deathState` VARCHAR(40) NULL DEFAULT NULL ,
CHANGE COLUMN `deathCity` `deathCity` VARCHAR(40) NULL ,
CHANGE COLUMN `nameFirst` `nameFirst` VARCHAR(40) NULL DEFAULT NULL ,
CHANGE COLUMN `nameLast` `nameLast` VARCHAR(40) NULL DEFAULT NULL ,
CHANGE COLUMN `bats` `bats` ENUM('R', 'L', 'B') NULL DEFAULT NULL ,
CHANGE COLUMN `throws` `throws` ENUM('R', 'L', 'S') NULL DEFAULT NULL ,
CHANGE COLUMN `retroID` `retroID` VARCHAR(12) NULL DEFAULT NULL ,
CHANGE COLUMN `bbrefID` `bbrefID` VARCHAR(12) NULL DEFAULT NULL ;
~~~~

### 3) Add an isDead Column that is either 'Y' or 'N'
Some things to think of: What data type should this column be? How do you know if the player is dead or not?

'Y' means the player is dead

'N' means the player is alive

#### Explanation

We want to find out if a player is alive or dead and we do this by seeing if they have a date for their death.

#### Change

We add an isDead column and check if the death year or death country exist, if it does we input yes and if it doesnt we input no.

#### SQL

~~~~sql
ALTER TABLE `lahman2019`.`people` 
ADD COLUMN `isDead` ENUM('Y', 'N') NULL AFTER `bbrefID`;
UPDATE people
SET isDead='Y'
WHERE deathYear is not null or deathCountry is not null;
UPDATE people
SET isDead='N'
WHERE deathYear is null and deathCountry is null;
~~~~

#### Tests

In [16]:
%sql SELECT * FROM people WHERE isDead = 'N' limit 10

 * mysql+pymysql://jhatkins:***@localhost/lahman2019
10 rows affected.

[('aardsda01', 1981, 12, 27, 'USA', 'CO', 'Denver', None, None, None, None, None, None, 'David', 'Aardsma', 'David Allan', 215, 75, 'R', 'R', datetime.date(2004, 4, 6), datetime.date(2015, 8, 23), 'aardd001', 'aardsda01', 'N'),
 ('aaronha01', 1934, 2, 5, 'USA', 'AL', 'Mobile', None, None, None, None, None, None, 'Hank', 'Aaron', 'Henry Louis', 180, 72, 'R', 'R', datetime.date(1954, 4, 13), datetime.date(1976, 10, 3), 'aaroh101', 'aaronha01', 'N'),
 ('aasedo01', 1954, 9, 8, 'USA', 'CA', 'Orange', None, None, None, None, None, None, 'Don', 'Aase', 'Donald William', 190, 75, 'R', 'R', datetime.date(1977, 7, 26), datetime.date(1990, 10, 3), 'aased001', 'aasedo01', 'N'),
 ('abadan01', 1972, 8, 25, 'USA', 'FL', 'Palm Beach', None, None, None, None, None, None, 'Andy', 'Abad', 'Fausto Andres', 184, 73, 'L', 'L', datetime.date(2001, 9, 10), datetime.date(2006, 4, 13), 'abada001', 'abadan01', 'N'),
 ('abadfe01', 1985, 12, 17, 'D.R.', 'La Romana', 'La Romana', None, None, None, None, None, None, 'Fernando', 'Abad', 'Fernando Antonio', 235, 74, 'L', 'L', datetime.date(2010, 7, 28), datetime.date(2019, 9, 28), 'abadf001', 'abadfe01', 'N'),
 ('abbotgl01', 1951, 2, 16, 'USA', 'AR', 'Little Rock', None, None, None, None, None, None, 'Glenn', 'Abbott', 'William Glenn', 200, 78, 'R', 'R', datetime.date(1973, 7, 29), datetime.date(1984, 8, 8), 'abbog001', 'abbotgl01', 'N'),
 ('abbotje01', 1972, 8, 17, 'USA', 'GA', 'Atlanta', None, None, None, None, None, None, 'Jeff', 'Abbott', 'Jeffrey William', 190, 74, 'R', 'L', datetime.date(1997, 6, 10), datetime.date(2001, 9, 29), 'abboj002', 'abbotje01', 'N'),
 ('abbotji01', 1967, 9, 19, 'USA', 'MI', 'Flint', None, None, None, None, None, None, 'Jim', 'Abbott', 'James Anthony', 200, 75, 'L', 'L', datetime.date(1989, 4, 8), datetime.date(1999, 7, 21), 'abboj001', 'abbotji01', 'N'),
 ('abbotku01', 1969, 6, 2, 'USA', 'OH', 'Zanesville', None, None, None, None, None, None, 'Kurt', 'Abbott', 'Kurt Thomas', 180, 71, 'R', 'R', datetime.date(1993, 9, 7), datetime.date(2001, 4, 13), 'abbok002', 'abbotku01', 'N'),
 ('abbotky01', 1968, 2, 18, 'USA', 'MA', 'Newburyport', None, None, None, None, None, None, 'Kyle', 'Abbott', 'Lawrence Kyle', 200, 76, 'L', 'L', datetime.date(1991, 9, 10), datetime.date(1996, 8, 24), 'abbok001', 'abbotky01', 'N')]

### 4) Add a deathDate and birthDate column
Some things to think of: What do you do if you are missing information? What datatype should this column be?

#### Explanation

We add a column that concatonates the day, month and year into one date for both birth and death.

#### Change

We used the concatanate command to combine the year, day, month together and then input that into a date column which matches the type to date.

#### SQL

~~~~sql
ALTER TABLE 'lahman2019'.'people' 
ADD COLUMN 'birthDate' DATE NULL DEFAULT NULL AFTER 'isDead'
ADD COLUMN 'deathDate' DATE NULL DEFAULT NULL AFTER 'birthDate';

UPDATE people
SET birthDate=CONCAT(birthYear, '-', birthMonth, '-', birthDay);

UPDATE people
SET deathDate=CONCAT(deathYear, '-', deathMonth, '-', deathDay);
~~~~

#### Tests

In [17]:
%sql SELECT deathDate FROM people WHERE deathDate >= '2005-01-01' ORDER BY deathDate ASC LIMIT 10;

 * mysql+pymysql://jhatkins:***@localhost/lahman2019
10 rows affected.

[(datetime.date(2005, 1, 4),),
 (datetime.date(2005, 1, 7),),
 (datetime.date(2005, 1, 9),),
 (datetime.date(2005, 1, 10),),
 (datetime.date(2005, 1, 21),),
 (datetime.date(2005, 1, 22),),
 (datetime.date(2005, 1, 31),),
 (datetime.date(2005, 2, 4),),
 (datetime.date(2005, 2, 8),),
 (datetime.date(2005, 2, 11),)]

In [18]:
%sql SELECT birthDate FROM people WHERE birthDate <= '1965-01-01' ORDER BY birthDate ASC LIMIT 10;

 * mysql+pymysql://jhatkins:***@localhost/lahman2019
10 rows affected.

[(datetime.date(1820, 4, 17),),
 (datetime.date(1824, 10, 5),),
 (datetime.date(1832, 2, 25),),
 (datetime.date(1832, 9, 17),),
 (datetime.date(1832, 10, 23),),
 (datetime.date(1835, 1, 10),),
 (datetime.date(1836, 2, 29),),
 (datetime.date(1837, 12, 26),),
 (datetime.date(1838, 3, 10),),
 (datetime.date(1838, 7, 16),)]

### Final CREATE Statement

To find the create statement:

- Right click on the table name in workbench
- Select 'Copy to Clipboard'
- Select 'Create Statement' 

The create statement will now be copied into your clipboard and can be pasted into the cell below.

~~~~sql
CREATE TABLE `people` (
  `playerID` varchar(15) NOT NULL,
  `birthYear` int DEFAULT NULL,
  `birthMonth` int DEFAULT NULL,
  `birthDay` int DEFAULT NULL,
  `birthCountry` varchar(40) DEFAULT NULL,
  `birthState` varchar(40) DEFAULT NULL,
  `birthCity` varchar(40) DEFAULT NULL,
  `deathYear` int DEFAULT NULL,
  `deathMonth` int DEFAULT NULL,
  `deathDay` int DEFAULT NULL,
  `deathCountry` varchar(40) DEFAULT NULL,
  `deathState` varchar(40) DEFAULT NULL,
  `deathCity` varchar(40) DEFAULT NULL,
  `nameFirst` varchar(40) DEFAULT NULL,
  `nameLast` varchar(40) DEFAULT NULL,
  `nameGiven` text,
  `weight` int DEFAULT NULL,
  `height` int DEFAULT NULL,
  `bats` enum('R','L','B') DEFAULT NULL,
  `throws` enum('R','L','S') DEFAULT NULL,
  `debut` date DEFAULT NULL,
  `finalGame` date DEFAULT NULL,
  `retroID` varchar(12) DEFAULT NULL,
  `bbrefID` varchar(12) DEFAULT NULL,
  `isDead` enum('Y','N') DEFAULT NULL,
  `birthDate` date DEFAULT NULL,
  `deathDate` date DEFAULT NULL,
  PRIMARY KEY (`playerID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

~~~~

<hr style="height:2px">

## Batting Table

### 1) Convert all empty strings to NULL

#### Explanation

Nan values will lead to errors when functions are applied to the columns so we need to convert them to null so sql knows how to deal with the empty values.

#### Change

I took the long way and updated each column to remove nan values.

#### SQL

~~~~sql
UPDATE batting
SET lgID=null
WHERE lgID='nan';

UPDATE batting
SET RBI=null
WHERE RBI='nan';

UPDATE batting
SET SB=null
WHERE SB='nan';

UPDATE batting
SET CS=null
WHERE CS='nan';

UPDATE batting
SET IBB=null
WHERE IBB='nan';

UPDATE batting
SET HBP=null
WHERE HBP='nan';

UPDATE batting
SET SH=null
WHERE SH='nan';

UPDATE batting
SET SF=null
WHERE SF='nan';

UPDATE batting
SET GIDP=null
WHERE GIDP='nan';

UPDATE batting
SET SO=null
WHERE SO='nan';
~~~~

#### Tests

In [21]:
%sql SELECT count(*) FROM lahman2019.batting where RBI is NULL;

 * mysql+pymysql://jhatkins:***@localhost/lahman2019
1 rows affected.

[(756,)]

### 2) Change column datatypes to appropriate values (ENUM, INT, VARCHAR, DATETIME, ETC)

#### Explanation

The datatypes of the table need to be changed from text to their true types. This will ensure that we can immediately error check by making sure the input and each value of the column is the correct type or null.

#### Change

All the stat categories were changed to INT,  the ID categories were changed to VARCHAR(45) and the stint and lgID were changed to ENUM.

#### SQL

~~~~sql
ALTER TABLE `lahman2019`.`batting` 
CHANGE COLUMN `playerID` `playerID` VARCHAR(45) NULL DEFAULT NULL ,
CHANGE COLUMN `yearID` `yearID` VARCHAR(45) NULL DEFAULT NULL ,
CHANGE COLUMN `stint` `stint` ENUM('1', '2', '3', '4', '5') NULL DEFAULT NULL ,
CHANGE COLUMN `teamID` `teamID` VARCHAR(45) NULL DEFAULT NULL ,
CHANGE COLUMN `lgID` `lgID` ENUM('AL', 'NL') NULL DEFAULT NULL ,
CHANGE COLUMN `G` `G` INT NULL DEFAULT NULL ,
CHANGE COLUMN `AB` `AB` INT NULL DEFAULT NULL ,
CHANGE COLUMN `R` `R` INT NULL DEFAULT NULL ,
CHANGE COLUMN `H` `H` INT NULL DEFAULT NULL ,
CHANGE COLUMN `2B` `2B` INT NULL DEFAULT NULL ,
CHANGE COLUMN `3B` `3B` INT NULL DEFAULT NULL ,
CHANGE COLUMN `HR` `HR` INT NULL DEFAULT NULL ,
CHANGE COLUMN `RBI` `RBI` INT NULL DEFAULT NULL ,
CHANGE COLUMN `SB` `SB` INT NULL DEFAULT NULL ,
CHANGE COLUMN `CS` `CS` INT NULL DEFAULT NULL ,
CHANGE COLUMN `BB` `BB` INT NULL DEFAULT NULL ,
CHANGE COLUMN `SO` `SO` INT NULL DEFAULT NULL ,
CHANGE COLUMN `IBB` `IBB` INT NULL DEFAULT NULL ,
CHANGE COLUMN `HBP` `HBP` INT NULL DEFAULT NULL ,
CHANGE COLUMN `SH` `SH` INT NULL DEFAULT NULL ,
CHANGE COLUMN `SF` `SF` INT NULL DEFAULT NULL ,
CHANGE COLUMN `GIDP` `GIDP` INT NULL DEFAULT NULL ;

~~~~

### 3) Add a Primary Key
Two options for the Primary Key:

- Composite Key: playerID, yearID, stint
- Covering Key: playerID, yearID, stint, teamID


#### Choice

I chose the covering key

#### Explanation

I chose the covering key as it didn't seem any more inconvienent as all the datatypes possible are non-null anyways but a covering key provides faster lookup so it seemed more efficent.

#### SQL

~~~~sql
ALTER TABLE `lahman2019`.`batting` 
CHANGE COLUMN `playerID` `playerID` VARCHAR(45) NOT NULL ,
CHANGE COLUMN `yearID` `yearID` VARCHAR(45) NOT NULL ,
CHANGE COLUMN `stint` `stint` ENUM('1', '2', '3', '4', '5') NOT NULL ,
CHANGE COLUMN `teamID` `teamID` VARCHAR(45) NOT NULL ,
ADD PRIMARY KEY (`playerID`, `yearID`, `stint`, `teamID`);
;

~~~~

#### Test

In [22]:
%sql SHOW KEYS FROM batting WHERE Key_name = 'PRIMARY' and Column_name = 'playerID'

 * mysql+pymysql://jhatkins:***@localhost/lahman2019
1 rows affected.

[('batting', 0, 'PRIMARY', 1, 'playerID', 'A', 18696, None, None, '', 'BTREE', '', '', 'YES', None)]

### 4) Add a foreign key on playerID between the People and Batting Tables
Note: Two people in the batting table do not exist in the people table. How should you handle this issue?

#### Explanation

I added playerID as a foreign key from the batting table to the people table. By starting from the batting table we handle the two people in batting that do not exist from the people table by matching to null values in the people table. By using the batting table we know that all foreign keys will have a matching primary key because playerID is part of the primary key in the batting table

#### Change

We altered the table to create a foreign key from batting to players using playerID.

#### SQL

~~~~sql
ALTER TABLE `lahman2019`.`batting` 
ADD CONSTRAINT `playerID`
  FOREIGN KEY (`playerID`)
  REFERENCES `lahman2019`.`people` (`playerID`)
  ON DELETE NO ACTION
  ON UPDATE NO ACTION;
~~~~

#### Tests

In [24]:
%sql Select playerID from batting where playerID not in (select playerID from people);

 * mysql+pymysql://jhatkins:***@localhost/lahman2019
0 rows affected.

[]

### Final CREATE Statement

To find the create statement:

- Right click on the table name in workbench
- Select 'Copy to Clipboard'
- Select 'Create Statement' 

The create statement will now be copied into your clipboard and can be pasted into the cell below.

~~~~sql
CREATE TABLE `batting` (
  `playerID` varchar(45) NOT NULL,
  `yearID` varchar(45) NOT NULL,
  `stint` enum('1','2','3','4','5') NOT NULL,
  `teamID` varchar(45) NOT NULL,
  `lgID` enum('NL', 'AL') DEFAULT NULL,
  `G` int DEFAULT NULL,
  `AB` int DEFAULT NULL,
  `R` int DEFAULT NULL,
  `H` int DEFAULT NULL,
  `2B` int DEFAULT NULL,
  `3B` int DEFAULT NULL,
  `HR` int DEFAULT NULL,
  `RBI` int DEFAULT NULL,
  `SB` int DEFAULT NULL,
  `CS` int DEFAULT NULL,
  `BB` int DEFAULT NULL,
  `SO` int DEFAULT NULL,
  `IBB` int DEFAULT NULL,
  `HBP` int DEFAULT NULL,
  `SH` int DEFAULT NULL,
  `SF` int DEFAULT NULL,
  `GIDP` int DEFAULT NULL,
  PRIMARY KEY (`playerID`,`yearID`,`stint`,`teamID`),
  CONSTRAINT `playerID` FOREIGN KEY (`playerID`) REFERENCES `people` (`playerID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

~~~~

<hr style="height:2px">

## Part 2: Career Highlights of Award Winning Players


- Find the ```playerID, firstName, lastName, number of awards, number of games played and number of home runs```, for every player.


- Group the entries by ```playerID``` and order by descending ```number of awards``` values

- You need to return 10 rows.

- Hint the ```IFNULL()``` command helps when joining tables

<u>Answer:</u>

#### Run your query

~~~~sql
SELECT awardsPlayers.playerID as playerID, people.nameFirst, people.nameLast,  COUNT(awardsplayers.playerID) as awards, GP, HR
FROM awardsPlayers
LEFT JOIN (SELECT people.nameFirst, people.nameLast, people.playerID
			FROM people
            GROUP BY people.playerID)
	people ON awardsPlayers.playerID=people.playerID
LEFT JOIN (SELECT SUM(batting.HR) as HR, SUM(batting.G) as GP, batting.playerID
		   FROM batting
           GROUP BY batting.playerID) batting ON awardsPlayers.playerID=batting.playerID
GROUP BY playerID 
ORDER BY awards DESC 
LIMIT 10;
~~~~

#### Expected output

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
10 rows affected.

[('bondsba01', 'Barry', 'Bonds', 47, 2986.0, 762.0),
 ('willite01', 'Ted', 'Williams', 39, 2292.0, 521.0),
 ('dimagjo01', 'Joe', 'DiMaggio', 36, 1736.0, 361.0),
 ('musiast01', 'Stan', 'Musial', 34, 3026.0, 475.0),
 ('johnswa01', 'Walter', 'Johnson', 33, 937.0, 2541.0),
 ('ruthba01', 'Babe', 'Ruth', 33, 2504.0, 7360.0),
 ('schmimi01', 'Mike', 'Schmidt', 33, 2404.0, 548.0),
 ('mayswi01', 'Willie', 'Mays', 32, 2992.0, 660.0),
 ('robinbr01', 'Brooks', 'Robinson', 32, 2896.0, 268.0),
 ('cobbty01', 'Ty', 'Cobb', 31, 3034.0, 234.0)]